{"word2idx": {"<pad>": 0, "<start>": 1, "<end>": 2, "<unk>": 3, "green": 4, "seamed": 5, "a-line": 6, "dress": 7, "red": 8, "contemporary": 9, "metallic": 10, "floral": 11, "print": 12, "cami": 13, "multicolor": 14, "abstract": 15, "white": 16, "chiffon": 17, "one-shoulder": 18, "black": 19, "short": 20, "rosie": 21, "shirt": 22, "gauze": 23, "printed": 24, "silk-jersey": 25, "wrap": 26, "midnight": 27, "blue": 28, "midi": 29, "herv\u00e9": 30, "l\u00e9ger": 31, "novelty": 32, "essentials": 33, "bandage": 34, "yellow": 35, "silk": 36, "t-shirt": 37, "one": 38, "shoulder": 39, "beige": 40, "scarlett": 41, "knee-length": 42, "sleeveless": 43, "ballgown": 44, "aldridge": 45, "tube": 46, "denim": 47, "cut-out": 48, "detail": 49, "off-shoulder": 50, "jersey": 51, "patterned": 52, "drop-waist": 53, "diana": 54, "gingham": 55, "geometric": 56, "cotton": 57, "poplin": 58, "floral-print": 59, "mesh": 60, "fit-and-flare": 61, "stretch": 62, "day": 63, "crepe": 64, "drop": 65, "waist": 66, "front": 67, "spot": 68, "orange": 69, "heathered": 70, "knit": 71, "patch": 72, "sleeve": 73, "tee": 74, "zip": 75, "striped": 76, "polo": 77, "effortless": 78, "modal": 79, "tank": 80, "asymmetric": 81, "de": 82, "chine": 83, "mini": 84, "pleated": 85, "sheath": 86, "teal": 87, "embroidered": 88, "v-neck": 89, "ponte": 90, "sunburst": 91, "pleat": 92, "lace": 93, "stripe": 94, "oversized": 95, "tencel": 96, "tilda": 97, "v": 98, "back": 99, "double": 100, "dream": 101, "lover": 102, "button": 103, "megan": 104, "animal": 105, "caftan": 106, "maternity": 107, "shirred": 108, "shift": 109, "popover": 110, "gray": 111, "guipure": 112, "cape": 113, "draped": 114, "long": 115, "ruffle": 116, "scuba": 117, "shirtdress": 118, "purple": 119, "textured": 120, "satin": 121, "bandeau": 122, "layered": 123, "harlie": 124, "cutout": 125, "colorblocked": 126, "dungaree": 127, "fringed": 128, "fitted": 129, "colorblock": 130, "star": 131, "flared": 132, "strappy": 133, "empire": 134, "flute": 135, "strapless": 136, "tie": 137, "eve": 138, "ribbed": 139, "bodycon": 140, "paisley": 141, "halter": 142, "neck": 143, "gown": 144, "mock": 145, "women": 146, "'s": 147, "maison": 148, "asymmetrical": 149, "cap-sleeve": 150, "body-con": 151, "silk-chiffon": 152, "silver": 153, "angel": 154, "kimono": 155, "belted": 156, "voile": 157, "cactus": 158, "chambray": 159, "slip": 160, "bell-sleeve": 161, "pocket": 162, "sleeves": 163, "so": 164, "social": 165, "structured": 166, "into": 167, "you": 168, "western": 169, "plaid": 170, "logo": 171, "sweatshirt": 172, "strap": 173, "open-back": 174, "my": 175, "samantha": 176, "paris": 177, "pink": 178, "backless": 179, "maxi": 180, "skirt": 181, "swallow": 182, "cotton-jersey": 183, "diamond": 184, "fil": 185, "coupe": 186, "renley": 187, "fit": 188, "flare": 189, "ombre": 190, "belt": 191, "short-sleeved": 192, "resort": 193, "texture": 194, "color": 195, "block": 196, "frayed": 197, "woven": 198, "brown": 199, "linen": 200, "natural": 201, "petite": 202, "x": 203, "revolve": 204, "life": 205, "eyelet": 206, "oriental": 207, "ikat": 208, "frock": 209, "high-neck": 210, "tunic": 211, "ophelia": 212, "curve": 213, "hem": 214, "intarsia": 215, "tweed": 216, "easy": 217, "camo": 218, "100": 219, "%": 220, "bloomingdale": 221, "exclusive": 222, "mirage": 223, "gigi": 224, "contrast": 225, "collar": 226, "shortsleeved": 227, "trim": 228, "buttoned": 229, "cut": 230, "compare": 231, "foil": 232, "transparent": 233, "ruched": 234, "paisley-print": 235, "mona": 236, "kaftan": 237, "stretch-crepe": 238, "blythe": 239, "suede": 240, "fringe": 241, "flutter": 242, "nightgown": 243, "oversize": 244, "curved": 245, "grid": 246, "viola": 247, "cotton-blend": 248, "ruby": 249, "selena": 250, "italian": 251, "cady": 252, "kate": 253, "jumper": 254, "peasant": 255, "tulum": 256, "size": 257, "louise": 258, "pencil": 259, "juliet": 260, "silk-blend": 261, "spaghetti": 262, "trapeze": 263, "b": 264, "swirl": 265, "pinafore": 266, "knot-front": 267, "embellished": 268, "strappy-back": 269, "skater": 270, "layer": 271, "dotted": 272, "trendy": 273, "plus": 274, "toni": 275, "panel": 276, "delaney": 277, "crochet": 278, "3/4-sleeve": 279, "cotton-poplin": 280, "all": 281, "over": 282, "baroque": 283, "sequin": 284, "plunge": 285, "ella": 286, "mia": 287, "3/4": 288, "surplice": 289, "inset": 290, "ribbon": 291, "organza": 292, "olivia": 293, "off-the-shoulder": 294, "off": 295, "sides": 296, "sunny": 297, "daisy": 298, "mid-length": 299, "hi-lo": 300, "dye": 301, "high": 302, "boat": 303, "muscle": 304, "cocktail": 305, "tie-waist": 306, "up": 307, "beach": 308, "twisted": 309, "sophie": 310, "band": 311, "like": 312, "it": 313, "hot": 314, "gathered": 315, "cap": 316, "gold": 317, "paillette": 318, "wrap-front": 319, "autumn": 320, "heart": 321, "mixed": 322, "romy": 323, "fit-": 324, "&": 325, "-flare": 326, "valencia": 327, "split": 328, "occasion": 329, "drape": 330, "length": 331, "crossover": 332, "vee": 333, "rib": 334, "bonded": 335, "dot-print": 336, "exposed": 337, "sundown": 338, "t-back": 339, "judith": 340, "overall": 341, "knee": 342, "sheer": 343, "inserts": 344, "bow": 345, "picnic": 346, "smocked": 347, "multi": 348, "blend": 349, "bella": 350, "high/low": 351, "wild": 352, "sand": 353, "broderie": 354, "anglaise": 355, "salon": 356, "bodice": 357, "clara": 358, "racerback": 359, "amelia": 360, "handkerchief-hem": 361, "moon": 362, "sundress": 363, "stretch-cotton": 364, "nicola": 365, "savannah": 366, "minidress": 367, "mikado": 368, "crocheted": 369, "new": 370, "julian": 371, "two": 372, "ruffled": 373, "clean": 374, "obi": 375, "overlay": 376, "seersucker": 377, "border": 378, "palm": 379, "tie-neck": 380, "flounce": 381, "esme": 382, "tie-dye": 383, "jodie": 384, "check": 385, "bias": 386, "drawstring": 387, "polka": 388, "henley": 389, "rayon": 390, "twill": 391, "slit": 392, "tulle": 393, "prom": 394, "taylor": 395, "top": 396, "jeanne": 397, "geo-print": 398, "french": 399, "terry": 400, "roza": 401, "sun": 402, "ladder": 403, "square": 404, "sateen": 405, "retro": 406, "hi-low": 407, "v-back": 408, "taffeta": 409, "short-sleeve": 410, "arrow": 411, "scarf": 412, "illusion": 413, "lace-paneled": 414, "jacquard": 415, "mandarin": 416, "large": 417, "grommet": 418, "stand": 419, "high-low": 420, "scoop": 421, "mock-neck": 422, "polka-dot": 423, "tassel": 424, "out": 425, "cora": 426, "petal": 427, "party": 428, "scalloped": 429, "zipper": 430, "pop": 431, "neoprene": 432, "nic+zoe": 433, "keyhole": 434, "silk-crepe": 435, "dot": 436, "sadie": 437, "nights": 438, "beaded": 439, "candy": 440, "handkerchief": 441, "viscose": 442, "cold": 443, "swing": 444, "w/": 445, "studded": 446, "half-sleeve": 447, "duster": 448, "co-ord": 449, "set": 450, "boutique": 451, "jessica": 452, "open": 453, "delia": 454, "d-ring": 455, "key": 456, "hole": 457, "knitted": 458, "ari": 459, "sia": 460, "lattice": 461, "side": 462, "sweetheart": 463, "peplum": 464, "elle": 465, "mid": 466, "arianna": 467, "low": 468, "lara": 469, "halterneck": 470, "grace": 471, "flock": 472, "lily": 473, "dobby": 474, "kelly": 475, "amy": 476, "tape": 477, "scallop": 478, "celine": 479, "naya": 480, "lace-trim": 481, "tailored": 482, "collared": 483, "bell": 484, "tegan": 485, "patchwork": 486, "maria": 487, "chain": 488, "piped": 489, "stitch": 490, "sarai": 491, "signature": 492, "self-tie": 493, "alice": 494, "jeans": 495, "neckline": 496, "watercolor": 497, "fluted": 498, "night": 499, "shantung": 500, "frill": 501, "dawn": 502, "paneled": 503, "button-front": 504, "cutwork": 505, "aline": 506, "faux-wrap": 507, "now": 508, "three-quarter": 509, "detailed": 510, "yoke": 511, "dolman": 512, "georgette": 513, "say": 514, "name": 515, "a": 516, "tiered": 517, "metal": 518, "love": 519, "maternity/nursing": 520, "geo": 521, "light": 522, "tea": 523, "solid": 524, "bardot": 525, "premium": 526, "lucy": 527, "cross": 528, "faux": 529, "tie-front": 530, "full": 531, "women\u00e2\u0080\u0099s": 532, "robe": 533, "carrie": 534, "evie": 535, "wedding": 536, "lola": 537, "curvy": 538, "brocade": 539, "piping": 540, "matte": 541, "down": 542, "sleeved": 543, "color-blocked": 544, "media": 545, "long-sleeve": 546, "knot": 547, "leather": 548, "tier": 549, "trina": 550, "insert": 551, "cuff": 552, "roll": 553, "ivory": 554, "raquel": 555, "summer": 556, "smock": 557, "shutter": 558, "blouson": 559, "snake": 560, "tall": 561, "placed": 562, "vintage": 563, "rose": 564, "anna": 565, "knotted": 566, "column": 567, "navy": 568, "tapestry": 569, "flora": 570, "me": 571, "digital": 572, "amanda": 573, "janelle": 574, "mockneck": 575, "n": 576, "pretty": 577, "soft": 578, "embellishment": 579, "faux-suede": 580, "jules": 581, "colourblock": 582, "tight": 583, "rope": 584, "abbie": 585, "basic": 586, "plisse": 587, "botanical": 588, "crop": 589, "jessa": 590, "fishtail": 591, "pinny": 592, "tonal": 593, "michelle": 594, "keegan": 595, "loves": 596, "karmic": 597, "sequined": 598, "claudia": 599, "about": 600, "shimmer": 601, "effect": 602, "cover-up": 603, "embroidery": 604, "flower": 605, "harold": 606, "pinstripe": 607, "origami": 608, "slipdress": 609, "calla": 610, "flowy": 611, "sophia": 612, "melange": 613, "lydia": 614, "rainbow": 615, "crisscross": 616, "jacey": 617, "east": 618, "freya": 619, "ellena": 620, "lacing": 621, "rachel": 622, "natasha": 623, "delicate": 624, "silvia": 625, "lace-up": 626, "three": 627, "quarter": 628, "style": 629, "indigo": 630, "elected": 631, "velvet": 632, "around": 633, "garden": 634, "seam": 635, "stella": 636, "raglan": 637, "bianca": 638, "pockets": 639, "sweater": 640, "fold": 641, "caroline": 642, "slub": 643, "wrap-effect": 644, "ribbed-knit": 645, "apron": 646, "fabric": 647, "lightweight": 648, "sweat": 649, "colour": 650, "laser": 651, "silk-georgette": 652, "chevron": 653, "jewelneck": 654, "line": 655, "bellini": 656, "go": 657, "deep": 658, "trench": 659, "vest": 660, "blazer": 661, "twofer": 662, "bloom": 663, "leila": 664, "ellen": 665, "bubble": 666, "frills": 667, "slim": 668, "us": 669, "ri": 670, "dark": 671, "choker": 672, "graphic": 673, "jolie": 674, "amber": 675, "elisa": 676, "skye": 677, "mono": 678, "racer": 679, "ray": 680, "tulip": 681, "cross-back": 682, "think": 683, "twice": 684, "buckle": 685, "circle": 686, "queen": 687, "emily": 688, "regular": 689, "chloe": 690, "shoulders": 691, "dp": 692, "little": 693, "mistress": 694, "applique": 695, "jewel": 696, "nursing": 697, "checked": 698, "tenki": 699, "mint": 700, "touch": 701, "billie": 702, "blossom": 703, "chi": 704, "london": 705, "first": 706, "i": 707, "stone": 708, "wine": 709, "quilted": 710, "net": 711, "vila": 712, "cherry": 713, "luxe": 714, "leopard-print": 715, "blush": 716, "mix": 717, "elbow": 718, "ditsy": 719, "cara": 720, "julia": 721, "r": 722, "khaki": 723, "lee": 724, "hooded": 725, "sara": 726, "dual": 727, "monochrome": 728, "di": 729, "grey": 730, "cream": 731, "longsleeved": 732, "lurex": 733, "christie": 734, "midi-dress": 735, "short/knee": 736, "panelled": 737, "combo": 738, "pique": 739, "crew": 740, "tie-dyed": 741, "cleo": 742, "parker": 743, "slinky": 744, "wool-blend": 745, "funnel": 746, "walk": 747, "wire": 748, "magic": 749, "wool": 750, "baby": 751, "lena": 752, "stretch-cady": 753, "color-block": 754, "round": 755, "satin-trimmed": 756, "jackie": 757, "holly": 758, "sash": 759, "vine": 760, "spandex": 761, "princess": 762, "ria": 763, "iridescent": 764, "lula": 765, "heat": 766, "wave": 767, "cr\u00eape": 768, "floral-printed": 769, "cloqu\u00e9": 770, "sage": 771, "lace-sleeve": 772, "kia": 773, "jacket": 774, "nina": 775, "feather": 776, "cowl": 777, "shine": 778, "izabel": 779, "turtleneck": 780, "techno": 781, "cupro": 782, "cobalt": 783, "tahari": 784, "asl": 785, "kim": 786, "t": 787, "soutache": 788, "wavy": 789, "pattern": 790, "zarita": 791, "vanessa": 792, "cascade": 793, "floral-embroidered": 794, "gracie": 795, "orchid": 796, "colleen": 797, "ruffles": 798, "zip-front": 799, "rise": 800, "carmen": 801, "bolero": 802, "laminated": 803, "lapel": 804, "outs": 805, "braided": 806, "cutaway": 807, "ballet": 808, "maia": 809, "convertible": 810, "broderie-anglaise": 811, "adrianna": 812, "carly": 813, "hollywood": 814, "corset": 815, "stretch-knit": 816, "cold-shoulder": 817, "appliqu\u00e9": 818, "milano": 819, "starburst": 820, "cover": 821, "capelet": 822, "mermaid": 823, "babydoll": 824, "faille": 825, "abstract-print": 826, "more": 827, "faye": 828, "2": 829, "piece": 830, "amelie": 831, "madeline": 832, "to": 833, "sweet": 834, "gwen": 835, "foiled": 836, "wiggle": 837, "sequins": 838, "pointelle": 839, "modern": 840, "paradise": 841, "city": 842, "break": 843, "tone": 844, "burnout": 845, "2-piece": 846, "fiona": 847, "bustier": 848, "3d": 849, "away": 850, "dip": 851, "molly": 852, "leah": 853, "isla": 854, "caviar": 855, "bead": 856, "may": 857, "wide": 858, "jessie": 859, "eloise": 860, "reina": 861, "peony": 862, "eyelash": 863, "batwing": 864, "alexis": 865, "tea-length": 866, "pliss\u00e9": 867, "petites": 868, "only": 869, "deborah": 870, "catherine": 871, "reversible": 872, "placement": 873, "twist": 874, "alana": 875, "draped-back": 876, "flounced": 877, "point": 878, "glitter": 879, "square-neck": 880, "jasmine": 881, "cowlneck": 882, "ottoman": 883, "loop": 884, ":": 885, "tilly": 886, "lace-trimmed": 887, "ara": 888, "appliques": 889, "details": 890, "lavish": 891, "rita": 892, "corded": 893, "silk-satin": 894, "hanky": 895, "thigh": 896, "leopard": 897, "evening": 898, "trimmed": 899, "lori": 900, "bi-stretch": 901, "suzie": 902, "merino": 903, "cashmere-blend": 904, "longsleeve": 905, "open-shoulder": 906, "reinaldo": 907, "louren\u00e7o": 908, "tied": 909, "lauren": 910, "lacey": 911, "glamour": 912, "boatneck": 913, "cape-sleeve": 914, "ellie": 915, "crossback": 916, "fonda": 917, "button-down": 918, "woodgrain": 919, "turtle": 920, "banded": 921, "laser-cut": 922, "no21": 923, "emmy": 924, "body": 925, "glennie": 926, "1": 927, "magnolia": 928, "eliza": 929, "ariel": 930, "lilly": 931, "pulitzer": 932, "stretch-jersey": 933, "mae": 934, "lam\u00e9": 935, "crochet-trim": 936, "linen-blend": 937, "houndstooth": 938, "la": 939, "chemise": 940, "bottom": 941, "erin": 942, "dani": 943, "classic": 944, "sequin-embellished": 945, "dip-dye": 946, "half": 947, "real": 948, "rouched": 949, "deco": 950, "laura": 951, "take": 952, "mila": 953, "plunging": 954, "bust": 955, "sequinned": 956, "teagan": 957, "chantilly": 958, "tapework": 959, "celia": 960, "leaf": 961, "empire-waist": 962, "perforated": 963, "twist-front": 964, "detachable": 965, "halter-neck": 966, "rosette": 967, "two-tone": 968, "gold-tone": 969, "no": 970, "lilac": 971, "eva": 972, "cashmere": 973, "breanna": 974, "necklace": 975, "rickie": 976, "freeman": 977, "portrait": 978, "marble": 979, "emma": 980, "rib-knit": 981, "zoe": 982, "crinkled": 983, "bib": 984, "sofia": 985, "wool-crepe": 986, "ball": 987, "adorn": 988, "hardware": 989, "showcase": 990, "beth": 991, "puff": 992, "tia": 993, "serena": 994, "waterfall": 995, "keira": 996, "sueded": 997, "penelope": 998, "tina": 999, "way": 1000, "brooch": 1001, "aurora": 1002, "victoria": 1003, "romper": 1004, "side-slit": 1005, "gazar": 1006, "spaghetti-strap": 1007, "shawl": 1008, "lace-bodice": 1009, "floor-length": 1010, "turquoise": 1011, "annabelle": 1012, "aria": 1013, "cutout-back": 1014, "removable": 1015, "trumpet": 1016, "willow": 1017, "sparkle": 1018, "dupioni": 1019, "d": 1020, "charmeuse": 1021, "nicole": 1022, "two-piece": 1023, "harlow": 1024, "nude": 1025, "plaza": 1026, "cage": 1027, "carpet": 1028, "cape-back": 1029, "floor": 1030, "crystal-embellished": 1031, "jeweled": 1032, "lace-detail": 1033, "godet": 1034, "cascading": 1035, "long-sleeved": 1036, "illusion-top": 1037, "conrad": 1038, "sonoma": 1039, "inesse": 1040, "cassie": 1041, "full-length": 1042, "scoop-neck": 1043, "lace-inset": 1044, "shadow": 1045, "newbury": 1046, "harper": 1047, "dc": 1048, "straps": 1049, "crystal": 1050, "aubrey": 1051, "maid": 1052, "silk-faille": 1053, "sheer-sleeve": 1054, "lace-accented": 1055, "jesse": 1056, "rhinestone": 1057, "liquid": 1058, "champagne": 1059, "bateau": 1060, "floral-beaded": 1061, "sequined-lace": 1062, "rosette-rose": 1063, "two-toned": 1064, "medallion": 1065, "floral-lace": 1066, "art": 1067, "rare": 1068, "isabella": 1069, "pintucked": 1070, "contour": 1071, "charlotte": 1072, "pima": 1073, "bridesmaid": 1074, "dressing": 1075, "pure": 1076, "runway": 1077, "floral-embellished": 1078, "infusion": 1079, "silk-tulle": 1080, "poppy": 1081, "saskia": 1082, "hi": 1083, "coup\u00e9": 1084, "sapphire": 1085, "silk-trim": 1086, "francesca": 1087, "bridal": 1088, "slits": 1089, "izzie": 1090, "butterfly": 1091, "filigree": 1092, "frilled": 1093, "brooklyn": 1094, "maggie": 1095, "scarlet": 1096, "jane": 1097, "daria": 1098, "medium": 1099, "appliqu\u00e3\u00a9": 1100, "m": 1101, "flight": 1102, "lace-overlay": 1103, "island": 1104, "virgin": 1105, "pearl": 1106, "maddie": 1107, "fleur": 1108, "flutter-sleeve": 1109, "polly": 1110, "melanie": 1111, "lolo": 1112, "maxidress": 1113, "dresses": 1114, "allover": 1115, "water": 1116, "boho": 1117, "nori": 1118, "major": 1119, "lexi": 1120, "embroided": 1121, "through": 1122, "lining": 1123, "pineapple": 1124, "crinkle": 1125, "ali": 1126, "caslon": 1127, "customize": 1128, "pom": 1129, "shell": 1130, "edge": 1131, "pintuck": 1132, "flocked": 1133, "desert": 1134, "japanese": 1135, "sally": 1136, "washed": 1137, "abigail": 1138, "tropical": 1139, "hemant": 1140, "nandita": 1141, "mason": 1142, "mara": 1143, "adele": 1144, "your": 1145, "luxury": 1146, "millie": 1147, "ivy": 1148, "michael": 1149, "kiara": 1150, "scoopneck": 1151, "faith": 1152, "nly": 1153, "riggs": 1154, "train": 1155, "alex": 1156, "tree": 1157, "bethany": 1158, "cashwool": 1159, "waffle-knit": 1160, "coral": 1161, "natalie": 1162, "paloma": 1163, "boyfriend": 1164, "peach": 1165, "pinstriped": 1166, "paige": 1167, "dropped-waist": 1168, "bird": 1169, "closet": 1170, "tuxedo": 1171, "fine": 1172, "soho": 1173, "mixer": 1174, "tiffany": 1175, "ava": 1176, "weave": 1177, "swim": 1178, "textured-knit": 1179, "maeve": 1180, "lia": 1181, "barnabus": 1182, "ttd": 1183, "than": 1184, "mackenzie": 1185, "slow": 1186, "2-in-1": 1187, "cable": 1188, "track": 1189, "boucle": 1190, "corduroy": 1191, "slouchy": 1192, "layla": 1193, "brushed": 1194, "usa": 1195, "florence": 1196, "utility": 1197, "prairie": 1198, "cord": 1199, "lacy": 1200, "charlie": 1201, "weekend": 1202, "crewneck": 1203, "whisper": 1204, "burgundy": 1205, "boat-neck": 1206, "stretch-ponte": 1207, "mac": 1208, "duggal": 1209, "royal": 1210, "stripes": 1211, "herringbone": 1212, "sydney": 1213, "switch": 1214, "ruffle-trim": 1215, "woman": 1216, "stretch-silk": 1217, "a.l.c": 1218, ".": 1219, "stretch-wool": 1220, "cinched": 1221, "camisole": 1222, "emery": 1223, "2pc": 1224, "sweaterdress": 1225, "bright": 1226, "genuine": 1227, "embossed": 1228, "mixed-media": 1229, "lovers": 1230, "quiz": 1231, "right": 1232, "cowl-neck": 1233, "zip-up": 1234, "st.": 1235, "barth": 1236, "tasha": 1237}, "idx2word": {"0": "<pad>", "1": "<start>", "2": "<end>", "3": "<unk>", "4": "green", "5": "seamed", "6": "a-line", "7": "dress", "8": "red", "9": "contemporary", "10": "metallic", "11": "floral", "12": "print", "13": "cami", "14": "multicolor", "15": "abstract", "16": "white", "17": "chiffon", "18": "one-shoulder", "19": "black", "20": "short", "21": "rosie", "22": "shirt", "23": "gauze", "24": "printed", "25": "silk-jersey", "26": "wrap", "27": "midnight", "28": "blue", "29": "midi", "30": "herv\u00e9", "31": "l\u00e9ger", "32": "novelty", "33": "essentials", "34": "bandage", "35": "yellow", "36": "silk", "37": "t-shirt", "38": "one", "39": "shoulder", "40": "beige", "41": "scarlett", "42": "knee-length", "43": "sleeveless", "44": "ballgown", "45": "aldridge", "46": "tube", "47": "denim", "48": "cut-out", "49": "detail", "50": "off-shoulder", "51": "jersey", "52": "patterned", "53": "drop-waist", "54": "diana", "55": "gingham", "56": "geometric", "57": "cotton", "58": "poplin", "59": "floral-print", "60": "mesh", "61": "fit-and-flare", "62": "stretch", "63": "day", "64": "crepe", "65": "drop", "66": "waist", "67": "front", "68": "spot", "69": "orange", "70": "heathered", "71": "knit", "72": "patch", "73": "sleeve", "74": "tee", "75": "zip", "76": "striped", "77": "polo", "78": "effortless", "79": "modal", "80": "tank", "81": "asymmetric", "82": "de", "83": "chine", "84": "mini", "85": "pleated", "86": "sheath", "87": "teal", "88": "embroidered", "89": "v-neck", "90": "ponte", "91": "sunburst", "92": "pleat", "93": "lace", "94": "stripe", "95": "oversized", "96": "tencel", "97": "tilda", "98": "v", "99": "back", "100": "double", "101": "dream", "102": "lover", "103": "button", "104": "megan", "105": "animal", "106": "caftan", "107": "maternity", "108": "shirred", "109": "shift", "110": "popover", "111": "gray", "112": "guipure", "113": "cape", "114": "draped", "115": "long", "116": "ruffle", "117": "scuba", "118": "shirtdress", "119": "purple", "120": "textured", "121": "satin", "122": "bandeau", "123": "layered", "124": "harlie", "125": "cutout", "126": "colorblocked", "127": "dungaree", "128": "fringed", "129": "fitted", "130": "colorblock", "131": "star", "132": "flared", "133": "strappy", "134": "empire", "135": "flute", "136": "strapless", "137": "tie", "138": "eve", "139": "ribbed", "140": "bodycon", "141": "paisley", "142": "halter", "143": "neck", "144": "gown", "145": "mock", "146": "women", "147": "'s", "148": "maison", "149": "asymmetrical", "150": "cap-sleeve", "151": "body-con", "152": "silk-chiffon", "153": "silver", "154": "angel", "155": "kimono", "156": "belted", "157": "voile", "158": "cactus", "159": "chambray", "160": "slip", "161": "bell-sleeve", "162": "pocket", "163": "sleeves", "164": "so", "165": "social", "166": "structured", "167": "into", "168": "you", "169": "western", "170": "plaid", "171": "logo", "172": "sweatshirt", "173": "strap", "174": "open-back", "175": "my", "176": "samantha", "177": "paris", "178": "pink", "179": "backless", "180": "maxi", "181": "skirt", "182": "swallow", "183": "cotton-jersey", "184": "diamond", "185": "fil", "186": "coupe", "187": "renley", "188": "fit", "189": "flare", "190": "ombre", "191": "belt", "192": "short-sleeved", "193": "resort", "194": "texture", "195": "color", "196": "block", "197": "frayed", "198": "woven", "199": "brown", "200": "linen", "201": "natural", "202": "petite", "203": "x", "204": "revolve", "205": "life", "206": "eyelet", "207": "oriental", "208": "ikat", "209": "frock", "210": "high-neck", "211": "tunic", "212": "ophelia", "213": "curve", "214": "hem", "215": "intarsia", "216": "tweed", "217": "easy", "218": "camo", "219": "100", "220": "%", "221": "bloomingdale", "222": "exclusive", "223": "mirage", "224": "gigi", "225": "contrast", "226": "collar", "227": "shortsleeved", "228": "trim", "229": "buttoned", "230": "cut", "231": "compare", "232": "foil", "233": "transparent", "234": "ruched", "235": "paisley-print", "236": "mona", "237": "kaftan", "238": "stretch-crepe", "239": "blythe", "240": "suede", "241": "fringe", "242": "flutter", "243": "nightgown", "244": "oversize", "245": "curved", "246": "grid", "247": "viola", "248": "cotton-blend", "249": "ruby", "250": "selena", "251": "italian", "252": "cady", "253": "kate", "254": "jumper", "255": "peasant", "256": "tulum", "257": "size", "258": "louise", "259": "pencil", "260": "juliet", "261": "silk-blend", "262": "spaghetti", "263": "trapeze", "264": "b", "265": "swirl", "266": "pinafore", "267": "knot-front", "268": "embellished", "269": "strappy-back", "270": "skater", "271": "layer", "272": "dotted", "273": "trendy", "274": "plus", "275": "toni", "276": "panel", "277": "delaney", "278": "crochet", "279": "3/4-sleeve", "280": "cotton-poplin", "281": "all", "282": "over", "283": "baroque", "284": "sequin", "285": "plunge", "286": "ella", "287": "mia", "288": "3/4", "289": "surplice", "290": "inset", "291": "ribbon", "292": "organza", "293": "olivia", "294": "off-the-shoulder", "295": "off", "296": "sides", "297": "sunny", "298": "daisy", "299": "mid-length", "300": "hi-lo", "301": "dye", "302": "high", "303": "boat", "304": "muscle", "305": "cocktail", "306": "tie-waist", "307": "up", "308": "beach", "309": "twisted", "310": "sophie", "311": "band", "312": "like", "313": "it", "314": "hot", "315": "gathered", "316": "cap", "317": "gold", "318": "paillette", "319": "wrap-front", "320": "autumn", "321": "heart", "322": "mixed", "323": "romy", "324": "fit-", "325": "&", "326": "-flare", "327": "valencia", "328": "split", "329": "occasion", "330": "drape", "331": "length", "332": "crossover", "333": "vee", "334": "rib", "335": "bonded", "336": "dot-print", "337": "exposed", "338": "sundown", "339": "t-back", "340": "judith", "341": "overall", "342": "knee", "343": "sheer", "344": "inserts", "345": "bow", "346": "picnic", "347": "smocked", "348": "multi", "349": "blend", "350": "bella", "351": "high/low", "352": "wild", "353": "sand", "354": "broderie", "355": "anglaise", "356": "salon", "357": "bodice", "358": "clara", "359": "racerback", "360": "amelia", "361": "handkerchief-hem", "362": "moon", "363": "sundress", "364": "stretch-cotton", "365": "nicola", "366": "savannah", "367": "minidress", "368": "mikado", "369": "crocheted", "370": "new", "371": "julian", "372": "two", "373": "ruffled", "374": "clean", "375": "obi", "376": "overlay", "377": "seersucker", "378": "border", "379": "palm", "380": "tie-neck", "381": "flounce", "382": "esme", "383": "tie-dye", "384": "jodie", "385": "check", "386": "bias", "387": "drawstring", "388": "polka", "389": "henley", "390": "rayon", "391": "twill", "392": "slit", "393": "tulle", "394": "prom", "395": "taylor", "396": "top", "397": "jeanne", "398": "geo-print", "399": "french", "400": "terry", "401": "roza", "402": "sun", "403": "ladder", "404": "square", "405": "sateen", "406": "retro", "407": "hi-low", "408": "v-back", "409": "taffeta", "410": "short-sleeve", "411": "arrow", "412": "scarf", "413": "illusion", "414": "lace-paneled", "415": "jacquard", "416": "mandarin", "417": "large", "418": "grommet", "419": "stand", "420": "high-low", "421": "scoop", "422": "mock-neck", "423": "polka-dot", "424": "tassel", "425": "out", "426": "cora", "427": "petal", "428": "party", "429": "scalloped", "430": "zipper", "431": "pop", "432": "neoprene", "433": "nic+zoe", "434": "keyhole", "435": "silk-crepe", "436": "dot", "437": "sadie", "438": "nights", "439": "beaded", "440": "candy", "441": "handkerchief", "442": "viscose", "443": "cold", "444": "swing", "445": "w/", "446": "studded", "447": "half-sleeve", "448": "duster", "449": "co-ord", "450": "set", "451": "boutique", "452": "jessica", "453": "open", "454": "delia", "455": "d-ring", "456": "key", "457": "hole", "458": "knitted", "459": "ari", "460": "sia", "461": "lattice", "462": "side", "463": "sweetheart", "464": "peplum", "465": "elle", "466": "mid", "467": "arianna", "468": "low", "469": "lara", "470": "halterneck", "471": "grace", "472": "flock", "473": "lily", "474": "dobby", "475": "kelly", "476": "amy", "477": "tape", "478": "scallop", "479": "celine", "480": "naya", "481": "lace-trim", "482": "tailored", "483": "collared", "484": "bell", "485": "tegan", "486": "patchwork", "487": "maria", "488": "chain", "489": "piped", "490": "stitch", "491": "sarai", "492": "signature", "493": "self-tie", "494": "alice", "495": "jeans", "496": "neckline", "497": "watercolor", "498": "fluted", "499": "night", "500": "shantung", "501": "frill", "502": "dawn", "503": "paneled", "504": "button-front", "505": "cutwork", "506": "aline", "507": "faux-wrap", "508": "now", "509": "three-quarter", "510": "detailed", "511": "yoke", "512": "dolman", "513": "georgette", "514": "say", "515": "name", "516": "a", "517": "tiered", "518": "metal", "519": "love", "520": "maternity/nursing", "521": "geo", "522": "light", "523": "tea", "524": "solid", "525": "bardot", "526": "premium", "527": "lucy", "528": "cross", "529": "faux", "530": "tie-front", "531": "full", "532": "women\u00e2\u0080\u0099s", "533": "robe", "534": "carrie", "535": "evie", "536": "wedding", "537": "lola", "538": "curvy", "539": "brocade", "540": "piping", "541": "matte", "542": "down", "543": "sleeved", "544": "color-blocked", "545": "media", "546": "long-sleeve", "547": "knot", "548": "leather", "549": "tier", "550": "trina", "551": "insert", "552": "cuff", "553": "roll", "554": "ivory", "555": "raquel", "556": "summer", "557": "smock", "558": "shutter", "559": "blouson", "560": "snake", "561": "tall", "562": "placed", "563": "vintage", "564": "rose", "565": "anna", "566": "knotted", "567": "column", "568": "navy", "569": "tapestry", "570": "flora", "571": "me", "572": "digital", "573": "amanda", "574": "janelle", "575": "mockneck", "576": "n", "577": "pretty", "578": "soft", "579": "embellishment", "580": "faux-suede", "581": "jules", "582": "colourblock", "583": "tight", "584": "rope", "585": "abbie", "586": "basic", "587": "plisse", "588": "botanical", "589": "crop", "590": "jessa", "591": "fishtail", "592": "pinny", "593": "tonal", "594": "michelle", "595": "keegan", "596": "loves", "597": "karmic", "598": "sequined", "599": "claudia", "600": "about", "601": "shimmer", "602": "effect", "603": "cover-up", "604": "embroidery", "605": "flower", "606": "harold", "607": "pinstripe", "608": "origami", "609": "slipdress", "610": "calla", "611": "flowy", "612": "sophia", "613": "melange", "614": "lydia", "615": "rainbow", "616": "crisscross", "617": "jacey", "618": "east", "619": "freya", "620": "ellena", "621": "lacing", "622": "rachel", "623": "natasha", "624": "delicate", "625": "silvia", "626": "lace-up", "627": "three", "628": "quarter", "629": "style", "630": "indigo", "631": "elected", "632": "velvet", "633": "around", "634": "garden", "635": "seam", "636": "stella", "637": "raglan", "638": "bianca", "639": "pockets", "640": "sweater", "641": "fold", "642": "caroline", "643": "slub", "644": "wrap-effect", "645": "ribbed-knit", "646": "apron", "647": "fabric", "648": "lightweight", "649": "sweat", "650": "colour", "651": "laser", "652": "silk-georgette", "653": "chevron", "654": "jewelneck", "655": "line", "656": "bellini", "657": "go", "658": "deep", "659": "trench", "660": "vest", "661": "blazer", "662": "twofer", "663": "bloom", "664": "leila", "665": "ellen", "666": "bubble", "667": "frills", "668": "slim", "669": "us", "670": "ri", "671": "dark", "672": "choker", "673": "graphic", "674": "jolie", "675": "amber", "676": "elisa", "677": "skye", "678": "mono", "679": "racer", "680": "ray", "681": "tulip", "682": "cross-back", "683": "think", "684": "twice", "685": "buckle", "686": "circle", "687": "queen", "688": "emily", "689": "regular", "690": "chloe", "691": "shoulders", "692": "dp", "693": "little", "694": "mistress", "695": "applique", "696": "jewel", "697": "nursing", "698": "checked", "699": "tenki", "700": "mint", "701": "touch", "702": "billie", "703": "blossom", "704": "chi", "705": "london", "706": "first", "707": "i", "708": "stone", "709": "wine", "710": "quilted", "711": "net", "712": "vila", "713": "cherry", "714": "luxe", "715": "leopard-print", "716": "blush", "717": "mix", "718": "elbow", "719": "ditsy", "720": "cara", "721": "julia", "722": "r", "723": "khaki", "724": "lee", "725": "hooded", "726": "sara", "727": "dual", "728": "monochrome", "729": "di", "730": "grey", "731": "cream", "732": "longsleeved", "733": "lurex", "734": "christie", "735": "midi-dress", "736": "short/knee", "737": "panelled", "738": "combo", "739": "pique", "740": "crew", "741": "tie-dyed", "742": "cleo", "743": "parker", "744": "slinky", "745": "wool-blend", "746": "funnel", "747": "walk", "748": "wire", "749": "magic", "750": "wool", "751": "baby", "752": "lena", "753": "stretch-cady", "754": "color-block", "755": "round", "756": "satin-trimmed", "757": "jackie", "758": "holly", "759": "sash", "760": "vine", "761": "spandex", "762": "princess", "763": "ria", "764": "iridescent", "765": "lula", "766": "heat", "767": "wave", "768": "cr\u00eape", "769": "floral-printed", "770": "cloqu\u00e9", "771": "sage", "772": "lace-sleeve", "773": "kia", "774": "jacket", "775": "nina", "776": "feather", "777": "cowl", "778": "shine", "779": "izabel", "780": "turtleneck", "781": "techno", "782": "cupro", "783": "cobalt", "784": "tahari", "785": "asl", "786": "kim", "787": "t", "788": "soutache", "789": "wavy", "790": "pattern", "791": "zarita", "792": "vanessa", "793": "cascade", "794": "floral-embroidered", "795": "gracie", "796": "orchid", "797": "colleen", "798": "ruffles", "799": "zip-front", "800": "rise", "801": "carmen", "802": "bolero", "803": "laminated", "804": "lapel", "805": "outs", "806": "braided", "807": "cutaway", "808": "ballet", "809": "maia", "810": "convertible", "811": "broderie-anglaise", "812": "adrianna", "813": "carly", "814": "hollywood", "815": "corset", "816": "stretch-knit", "817": "cold-shoulder", "818": "appliqu\u00e9", "819": "milano", "820": "starburst", "821": "cover", "822": "capelet", "823": "mermaid", "824": "babydoll", "825": "faille", "826": "abstract-print", "827": "more", "828": "faye", "829": "2", "830": "piece", "831": "amelie", "832": "madeline", "833": "to", "834": "sweet", "835": "gwen", "836": "foiled", "837": "wiggle", "838": "sequins", "839": "pointelle", "840": "modern", "841": "paradise", "842": "city", "843": "break", "844": "tone", "845": "burnout", "846": "2-piece", "847": "fiona", "848": "bustier", "849": "3d", "850": "away", "851": "dip", "852": "molly", "853": "leah", "854": "isla", "855": "caviar", "856": "bead", "857": "may", "858": "wide", "859": "jessie", "860": "eloise", "861": "reina", "862": "peony", "863": "eyelash", "864": "batwing", "865": "alexis", "866": "tea-length", "867": "pliss\u00e9", "868": "petites", "869": "only", "870": "deborah", "871": "catherine", "872": "reversible", "873": "placement", "874": "twist", "875": "alana", "876": "draped-back", "877": "flounced", "878": "point", "879": "glitter", "880": "square-neck", "881": "jasmine", "882": "cowlneck", "883": "ottoman", "884": "loop", "885": ":", "886": "tilly", "887": "lace-trimmed", "888": "ara", "889": "appliques", "890": "details", "891": "lavish", "892": "rita", "893": "corded", "894": "silk-satin", "895": "hanky", "896": "thigh", "897": "leopard", "898": "evening", "899": "trimmed", "900": "lori", "901": "bi-stretch", "902": "suzie", "903": "merino", "904": "cashmere-blend", "905": "longsleeve", "906": "open-shoulder", "907": "reinaldo", "908": "louren\u00e7o", "909": "tied", "910": "lauren", "911": "lacey", "912": "glamour", "913": "boatneck", "914": "cape-sleeve", "915": "ellie", "916": "crossback", "917": "fonda", "918": "button-down", "919": "woodgrain", "920": "turtle", "921": "banded", "922": "laser-cut", "923": "no21", "924": "emmy", "925": "body", "926": "glennie", "927": "1", "928": "magnolia", "929": "eliza", "930": "ariel", "931": "lilly", "932": "pulitzer", "933": "stretch-jersey", "934": "mae", "935": "lam\u00e9", "936": "crochet-trim", "937": "linen-blend", "938": "houndstooth", "939": "la", "940": "chemise", "941": "bottom", "942": "erin", "943": "dani", "944": "classic", "945": "sequin-embellished", "946": "dip-dye", "947": "half", "948": "real", "949": "rouched", "950": "deco", "951": "laura", "952": "take", "953": "mila", "954": "plunging", "955": "bust", "956": "sequinned", "957": "teagan", "958": "chantilly", "959": "tapework", "960": "celia", "961": "leaf", "962": "empire-waist", "963": "perforated", "964": "twist-front", "965": "detachable", "966": "halter-neck", "967": "rosette", "968": "two-tone", "969": "gold-tone", "970": "no", "971": "lilac", "972": "eva", "973": "cashmere", "974": "breanna", "975": "necklace", "976": "rickie", "977": "freeman", "978": "portrait", "979": "marble", "980": "emma", "981": "rib-knit", "982": "zoe", "983": "crinkled", "984": "bib", "985": "sofia", "986": "wool-crepe", "987": "ball", "988": "adorn", "989": "hardware", "990": "showcase", "991": "beth", "992": "puff", "993": "tia", "994": "serena", "995": "waterfall", "996": "keira", "997": "sueded", "998": "penelope", "999": "tina", "1000": "way", "1001": "brooch", "1002": "aurora", "1003": "victoria", "1004": "romper", "1005": "side-slit", "1006": "gazar", "1007": "spaghetti-strap", "1008": "shawl", "1009": "lace-bodice", "1010": "floor-length", "1011": "turquoise", "1012": "annabelle", "1013": "aria", "1014": "cutout-back", "1015": "removable", "1016": "trumpet", "1017": "willow", "1018": "sparkle", "1019": "dupioni", "1020": "d", "1021": "charmeuse", "1022": "nicole", "1023": "two-piece", "1024": "harlow", "1025": "nude", "1026": "plaza", "1027": "cage", "1028": "carpet", "1029": "cape-back", "1030": "floor", "1031": "crystal-embellished", "1032": "jeweled", "1033": "lace-detail", "1034": "godet", "1035": "cascading", "1036": "long-sleeved", "1037": "illusion-top", "1038": "conrad", "1039": "sonoma", "1040": "inesse", "1041": "cassie", "1042": "full-length", "1043": "scoop-neck", "1044": "lace-inset", "1045": "shadow", "1046": "newbury", "1047": "harper", "1048": "dc", "1049": "straps", "1050": "crystal", "1051": "aubrey", "1052": "maid", "1053": "silk-faille", "1054": "sheer-sleeve", "1055": "lace-accented", "1056": "jesse", "1057": "rhinestone", "1058": "liquid", "1059": "champagne", "1060": "bateau", "1061": "floral-beaded", "1062": "sequined-lace", "1063": "rosette-rose", "1064": "two-toned", "1065": "medallion", "1066": "floral-lace", "1067": "art", "1068": "rare", "1069": "isabella", "1070": "pintucked", "1071": "contour", "1072": "charlotte", "1073": "pima", "1074": "bridesmaid", "1075": "dressing", "1076": "pure", "1077": "runway", "1078": "floral-embellished", "1079": "infusion", "1080": "silk-tulle", "1081": "poppy", "1082": "saskia", "1083": "hi", "1084": "coup\u00e9", "1085": "sapphire", "1086": "silk-trim", "1087": "francesca", "1088": "bridal", "1089": "slits", "1090": "izzie", "1091": "butterfly", "1092": "filigree", "1093": "frilled", "1094": "brooklyn", "1095": "maggie", "1096": "scarlet", "1097": "jane", "1098": "daria", "1099": "medium", "1100": "appliqu\u00e3\u00a9", "1101": "m", "1102": "flight", "1103": "lace-overlay", "1104": "island", "1105": "virgin", "1106": "pearl", "1107": "maddie", "1108": "fleur", "1109": "flutter-sleeve", "1110": "polly", "1111": "melanie", "1112": "lolo", "1113": "maxidress", "1114": "dresses", "1115": "allover", "1116": "water", "1117": "boho", "1118": "nori", "1119": "major", "1120": "lexi", "1121": "embroided", "1122": "through", "1123": "lining", "1124": "pineapple", "1125": "crinkle", "1126": "ali", "1127": "caslon", "1128": "customize", "1129": "pom", "1130": "shell", "1131": "edge", "1132": "pintuck", "1133": "flocked", "1134": "desert", "1135": "japanese", "1136": "sally", "1137": "washed", "1138": "abigail", "1139": "tropical", "1140": "hemant", "1141": "nandita", "1142": "mason", "1143": "mara", "1144": "adele", "1145": "your", "1146": "luxury", "1147": "millie", "1148": "ivy", "1149": "michael", "1150": "kiara", "1151": "scoopneck", "1152": "faith", "1153": "nly", "1154": "riggs", "1155": "train", "1156": "alex", "1157": "tree", "1158": "bethany", "1159": "cashwool", "1160": "waffle-knit", "1161": "coral", "1162": "natalie", "1163": "paloma", "1164": "boyfriend", "1165": "peach", "1166": "pinstriped", "1167": "paige", "1168": "dropped-waist", "1169": "bird", "1170": "closet", "1171": "tuxedo", "1172": "fine", "1173": "soho", "1174": "mixer", "1175": "tiffany", "1176": "ava", "1177": "weave", "1178": "swim", "1179": "textured-knit", "1180": "maeve", "1181": "lia", "1182": "barnabus", "1183": "ttd", "1184": "than", "1185": "mackenzie", "1186": "slow", "1187": "2-in-1", "1188": "cable", "1189": "track", "1190": "boucle", "1191": "corduroy", "1192": "slouchy", "1193": "layla", "1194": "brushed", "1195": "usa", "1196": "florence", "1197": "utility", "1198": "prairie", "1199": "cord", "1200": "lacy", "1201": "charlie", "1202": "weekend", "1203": "crewneck", "1204": "whisper", "1205": "burgundy", "1206": "boat-neck", "1207": "stretch-ponte", "1208": "mac", "1209": "duggal", "1210": "royal", "1211": "stripes", "1212": "herringbone", "1213": "sydney", "1214": "switch", "1215": "ruffle-trim", "1216": "woman", "1217": "stretch-silk", "1218": "a.l.c", "1219": ".", "1220": "stretch-wool", "1221": "cinched", "1222": "camisole", "1223": "emery", "1224": "2pc", "1225": "sweaterdress", "1226": "bright", "1227": "genuine", "1228": "embossed", "1229": "mixed-media", "1230": "lovers", "1231": "quiz", "1232": "right", "1233": "cowl-neck", "1234": "zip-up", "1235": "st.", "1236": "barth", "1237": "tasha"}, "idx": 1238}